package homework2;

import java.io.BufferedReader;
import java.io.FileReader;
import java.io.IOException;

//. Дана строка json:
// [{"фамилия":"Иванов","оценка":"5","предмет":"Математика"}, {"фамилия":"Петрова","оценка":"4","предмет":"Информатика"},
// {"фамилия":"Краснов","оценка":"5","предмет":"Физика"}]
// Написать метод, который распарсит этот текст и, используя StringBuilder, создаст строки вида:
// Студент [фамилия] получил [оценка] по предмету [предмет]. Например:
// Студент Иванов получил 5 по предмету Математика.
// Студент Петрова получил 4 по предмету Информатика.
// Студент Краснов получил 5 по предмету Физика.
public class Task2 {
    private static String json = "[{\"фамилия\":\"Иванов\",\"оценка\":\"5\",\"предмет\":\"Математика\"}, " +
            "{\"фамилия\":\"Петрова\",\"оценка\":\"4\",\"предмет\":\"Информатика\"}, " +
            "{\"фамилия\":\"Краснов\",\"оценка\":\"5\",\"предмет\":\"Физика\"}]";

    public static void parse() {
        StringBuilder sb = new StringBuilder();
        String[] name = json.split(",");
        for (String s : name) {
            if (s.split(":")[0].trim().replaceAll("[\"{}\\[\\]]", "").equals("фамилия")) {
                sb.append("Студент ").append(s.replaceAll("[\"{}\\[\\]]", "").split(":")[1]);
            }
            if (s.split(":")[0].trim().replaceAll("[\"{}\\[\\]]", "").equals("оценка")) {
                sb.append(" получил(-а) ").append(s.split(":")[1].replaceAll("[\"{}\\[\\]]", ""));
            }
            if (s.split(":")[0].trim().replaceAll("[\"{}\\[\\]]", "").equals("предмет")) {
                sb.append(" по предмету  ").append(s.split(":")[1].replaceAll("[\"{}\\[\\]]", "")).append(".\n");
            }
        }
        System.out.println(sb);
    }

}